app/controllers/api/educations_controller.rb

    def index
        @educations = Education.where(user_id: params[:user_id])
---
SELECT  "educations".* FROM "educations" WHERE "educations"."user_id" IS NULL LIMIT $1  [["LIMIT", 1]]

    def create
        @education = Education.new(education_params)

        if @education.save
---
INSERT INTO "educations" ("user_id", "school", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["school", "Clown College"], ["created_at", "2022-08-19 12:46:55.511586"], ["updated_at", "2022-08-19 12:46:55.511586"]]

    def update
        @education = Education.find_by(id: params[:id])
---
SELECT  "educations".* FROM "educations" WHERE "educations"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]