app/controllers/api/experiences_controller.rb

    def index
        @experiences = Experience.where(user_id: params[:user_id])
---
SELECT "experiences".* FROM "experiences" WHERE "experiences"."user_id" = $1  [["user_id", 1]]

    def create
        @experience = Experience.new(experience_params)

        if @experience.save
---
INSERT INTO "experiences" ("user_id", "title", "company_name", "location", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"