app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "zatrmYWgrK4m93V0Nd1HUw"], ["LIMIT", 1]]
---
    def current_user
        @current_user = User.find_by(session_token: session[:session_token])