app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "h5Gl2RbxmMwCYtxqhQPH_w"], ["updated_at", "2022-08-18 01:56:41.707274"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = generate_session_token
        self.save!